#### OpenTofu Plan
```
data.aws_vpc.default: Reading...
module.ecs_scheduled_task.aws_cloudwatch_event_rule.coordinator_schedule: Refreshing state... [id=agent-grid-coordinator-schedule]
module.networking.aws_eip.nat: Refreshing state... [id=eipalloc-0800e6e0c853de52f]
module.secrets.aws_secretsmanager_secret.coordinator[0]: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/coordinator-zKacFW]
module.networking.data.aws_availability_zones.available: Reading...
module.ecs_scheduled_task.aws_iam_role.ecs_task: Refreshing state... [id=agent-grid-ecs-task]
module.ecs_scheduled_task.aws_cloudwatch_log_group.coordinator: Refreshing state... [id=/ecs/agent-grid-coordinator]
module.apprunner.aws_ecr_repository.main: Refreshing state... [id=agent-grid]
module.secrets.aws_secretsmanager_secret.github[0]: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/github-kxiS8k]
module.apprunner.aws_iam_role.apprunner_ecr: Refreshing state... [id=agent-grid-apprunner-ecr]
module.ecs_scheduled_task.aws_iam_role.eventbridge_ecs: Refreshing state... [id=agent-grid-eventbridge-ecs]
module.ecs_scheduled_task.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-west-2:796973497082:cluster/agent-grid-scheduled]
module.apprunner.aws_iam_role.apprunner_instance: Refreshing state... [id=agent-grid-apprunner-instance]
module.networking.data.aws_availability_zones.available: Read complete after 1s [id=us-west-2]
module.secrets.aws_secretsmanager_secret.database: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/database-fPy9q1]
module.ecs_scheduled_task.aws_iam_role.ecs_execution: Refreshing state... [id=agent-grid-ecs-execution]
module.apprunner.aws_iam_role_policy_attachment.apprunner_ecr: Refreshing state... [id=agent-grid-apprunner-ecr-arn:aws:iam::aws:policy/service-role/AWSAppRunnerServicePolicyForECRAccess]
module.secrets.aws_secretsmanager_secret_version.coordinator[0]: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/coordinator-zKacFW|terraform-20260208161403403300000004]
module.secrets.aws_secretsmanager_secret_version.github[0]: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/github-kxiS8k|terraform-20260208162850209400000001]
module.apprunner.aws_ecr_lifecycle_policy.main: Refreshing state... [id=agent-grid]
module.ecs_scheduled_task.aws_iam_role_policy_attachment.ecs_execution_base: Refreshing state... [id=agent-grid-ecs-execution-20260208161403655100000005]
module.ecs_scheduled_task.aws_iam_role_policy.ecs_execution_secrets: Refreshing state... [id=agent-grid-ecs-execution:secrets-access]
module.apprunner.aws_iam_role_policy.apprunner_secrets[0]: Refreshing state... [id=agent-grid-apprunner-instance:secrets-access]
module.ecs_scheduled_task.aws_ecs_task_definition.coordinator: Refreshing state... [id=agent-grid-coordinator]
module.ecs_scheduled_task.aws_iam_role_policy.eventbridge_ecs: Refreshing state... [id=agent-grid-eventbridge-ecs:run-ecs-task]
data.aws_vpc.default: Read complete after 1s [id=vpc-056dbe74e9488482a]
data.aws_subnets.default: Reading...
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0070fe8b60dfdf03c]
aws_security_group.apprunner_private: Refreshing state... [id=sg-050b00e6a30cb4299]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0d05fd8917ae51260]
aws_security_group.apprunner: Refreshing state... [id=sg-09cea9336753f1a99]
data.aws_subnets.default: Read complete after 1s [id=us-west-2]
module.database.aws_db_subnet_group.main: Refreshing state... [id=agent-grid-db]
module.networking.aws_nat_gateway.main: Refreshing state... [id=nat-03cf2c70e6b753ad0]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-02e7cfa36abe76d93]
module.apprunner.aws_apprunner_vpc_connector.main[0]: Refreshing state... [id=arn:aws:apprunner:us-west-2:796973497082:vpcconnector/agent-grid-e144b639/1/8300cc2913004fe6a5a16c45aa4a2752]
module.ecs_scheduled_task.aws_cloudwatch_event_target.coordinator_ecs: Refreshing state... [id=agent-grid-coordinator-schedule-coordinator-ecs-task]
module.database.aws_security_group.db: Refreshing state... [id=sg-0ba3c91437322d937]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00e8cda779c0fea94]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08107066ef7bb5529]
module.apprunner.aws_apprunner_service.main: Refreshing state... [id=arn:aws:apprunner:us-west-2:796973497082:service/agent-grid/8056bfd1bf4b45829120921729836665]
module.database.aws_db_instance.main: Refreshing state... [id=db-PPFO63AFA7ND7R2NYKRCAU5Q7M]
module.secrets.aws_secretsmanager_secret_version.database: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/database-fPy9q1|terraform-20260208163612317800000001]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # module.apprunner.aws_apprunner_service.main will be updated in-place
  ~ resource "aws_apprunner_service" "main" {
        id                             = "arn:aws:apprunner:us-west-2:796973497082:service/agent-grid/8056bfd1bf4b45829120921729836665"
        tags                           = {
            "Environment" = "dev"
            "Project"     = "agent-grid"
        }
        # (7 unchanged attributes hidden)

      ~ source_configuration {
            # (1 unchanged attribute hidden)

          ~ image_repository {
                # (2 unchanged attributes hidden)

              ~ image_configuration {
                  # Warning: this attribute value will no longer be marked as sensitive
                  # after applying this change.
                  ~ runtime_environment_secrets   = (sensitive value)
                  ~ runtime_environment_variables = {
                      - "AGENT_GRID_SQS_JOB_QUEUE_URL"    = "https://sqs.us-west-2.amazonaws.com/796973497082/agent-grid-jobs" -> null
                      - "AGENT_GRID_SQS_RESULT_QUEUE_URL" = "https://sqs.us-west-2.amazonaws.com/796973497082/agent-grid-results" -> null
                        # (6 unchanged elements hidden)
                    }
                    # (1 unchanged attribute hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.apprunner.aws_iam_role_policy.apprunner_secrets[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "apprunner_secrets" {
        id     = "agent-grid-apprunner-instance:secrets-access"
        name   = "secrets-access"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database.aws_db_instance.main will be updated in-place
  ~ resource "aws_db_instance" "main" {
        id                                    = "db-PPFO63AFA7ND7R2NYKRCAU5Q7M"
      - password                              = (sensitive value) -> null
        tags                                  = {
            "Environment" = "dev"
            "Project"     = "agent-grid"
        }
        # (56 unchanged attributes hidden)
    }

  # module.ecs_scheduled_task.aws_cloudwatch_event_target.coordinator_ecs will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "coordinator_ecs" {
        id             = "agent-grid-coordinator-schedule-coordinator-ecs-task"
        # (6 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:us-west-2:796973497082:task-definition/agent-grid-coordinator:1" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.ecs_scheduled_task.aws_ecs_task_definition.coordinator must be replaced
-/+ resource "aws_ecs_task_definition" "coordinator" {
      ~ arn                      = "arn:aws:ecs:us-west-2:796973497082:task-definition/agent-grid-coordinator:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:796973497082:task-definition/agent-grid-coordinator" -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "agent-grid-coordinator" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "Environment" = "dev"
            "Project"     = "agent-grid"
        }
        # (10 unchanged attributes hidden)
    }

  # module.ecs_scheduled_task.aws_iam_role_policy.ecs_execution_secrets will be updated in-place
  ~ resource "aws_iam_role_policy" "ecs_execution_secrets" {
        id     = "agent-grid-ecs-execution:secrets-access"
        name   = "secrets-access"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.ecs_scheduled_task.aws_iam_role_policy.eventbridge_ecs will be updated in-place
  ~ resource "aws_iam_role_policy" "eventbridge_ecs" {
        id     = "agent-grid-eventbridge-ecs:run-ecs-task"
        name   = "run-ecs-task"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecs:RunTask",
                        ]
                      - Condition = {
                          - ArnLike = {
                              - "ecs:cluster" = "arn:aws:ecs:us-west-2:796973497082:cluster/agent-grid-scheduled"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:ecs:us-west-2:796973497082:task-definition/agent-grid-coordinator:1",
                        ]
                    },
                  - {
                      - Action   = [
                          - "iam:PassRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::796973497082:role/agent-grid-ecs-execution",
                          - "arn:aws:iam::796973497082:role/agent-grid-ecs-task",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.secrets.aws_secretsmanager_secret.github[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret" "github" {
      - arn                            = "arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/github-kxiS8k" -> null
      - description                    = "GitHub credentials for Agent Grid" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/github-kxiS8k" -> null
      - name                           = "agent-grid/github" -> null
      - recovery_window_in_days        = 30 -> null
      - tags                           = {
          - "Environment" = "dev"
          - "Project"     = "agent-grid"
        } -> null
      - tags_all                       = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Project"     = "agent-grid"
        } -> null
    }

  # module.secrets.aws_secretsmanager_secret_version.coordinator[0] must be replaced
-/+ resource "aws_secretsmanager_secret_version" "coordinator" {
      ~ arn                  = "arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/coordinator-zKacFW" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/coordinator-zKacFW|terraform-20260208161403403300000004" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260208161403403300000004" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.secrets.aws_secretsmanager_secret_version.database must be replaced
-/+ resource "aws_secretsmanager_secret_version" "database" {
      ~ arn                  = "arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/database-fPy9q1" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/database-fPy9q1|terraform-20260208163612317800000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260208163612317800000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.secrets.aws_secretsmanager_secret_version.github[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret_version" "github" {
      - arn            = "arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/github-kxiS8k" -> null
      - id             = "arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/github-kxiS8k|terraform-20260208162850209400000001" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-2:796973497082:secret:agent-grid/github-kxiS8k" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20260208162850209400000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

Plan: 3 to add, 6 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```
*Triggered by @mohithg via pull_request*